chore(grid): Updated documentation
